In [61]:
import pandas as pd

data = {
    'Name': ['Xavier', 'Ann', 'Jana', 'yi', 'Robin', 'Jamal', 'Nori'],
    'City': ['Mexico_city', 'Toranto', 'Prague', 'Shanghai', 'Manchester', 'Cairo', 'Osaka'],
    'Age': [41, 23, 34, 38, 31, 37, 29],
    'Py_Score': [88.0, 79.0, 81.0, 80.0, 68.0, 81.0, 84.0]}

Row_Labels = [101, 102, 103, 104, 105, 106, 107]
df = pd.DataFrame(data=data, index=Row_Labels)
print(df)

       Name         City  Age  Py_Score
101  Xavier  Mexico_city   41      88.0
102     Ann      Toranto   23      79.0
103    Jana       Prague   34      81.0
104      yi     Shanghai   38      80.0
105   Robin   Manchester   31      68.0
106   Jamal        Cairo   37      81.0
107    Nori        Osaka   29      84.0

In [62]:
df.head(n=2)

       Name         City  Age  Py_Score
101  Xavier  Mexico_city   41      88.0
102     Ann      Toranto   23      79.0

In [63]:
df.tail(n=3)

      Name        City  Age  Py_Score
105  Robin  Manchester   31      68.0
106  Jamal       Cairo   37      81.0
107   Nori       Osaka   29      84.0

In [64]:
cities=df['City']
cities

101    Mexico_city
102        Toranto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: City, dtype: object

In [65]:
df.City

101    Mexico_city
102        Toranto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: City, dtype: object

In [66]:
cities[107]

'Osaka'

In [67]:
df.loc[103]

Name          Jana
City        Prague
Age             34
Py_Score      81.0
Name: 103, dtype: object

In [68]:
import numpy as np
import pandas as pd
d = {'x': [1, 2, 3], 'y': np.array([2, 4, 8]), 'z': 100}
pd.DataFrame(d)

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [69]:
pd.DataFrame(d, index=[100, 200, 300], columns=['z', 'y', 'x'])

       z  y  x
100  100  2  1
200  100  4  2
300  100  8  3

In [70]:
list = [{'x': 1, 'y': 2, 'z': 100},
        {'x': 2, 'y': 4, 'z': 100},
        {'x': 3, 'y': 8, 'z': 100}]
pd.DataFrame(list)

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [71]:
list = [{ 1,2,100},
        {2,4,100},
        {3,8,100}]
pd.DataFrame(list,columns=['a','b','c'])

   a    b    c
0  1    2  100
1  2  100    4
2  8    3  100

In [72]:
arr = np.array([[1, 2,3], [2, 4, 100],[3, 8, 100]])
pd.DataFrame(arr,columns=['a','b','c'],index=[1,2,3])

   a  b    c
1  1  2    3
2  2  4  100
3  3  8  100

In [73]:
arr[0, 0] = 500

In [74]:
arr

array([[500,   2,   3],
       [  2,   4, 100],
       [  3,   8, 100]])

In [75]:
df.index

Index([101, 102, 103, 104, 105, 106, 107], dtype='int64')

In [76]:
df.columns

Index(['Name', 'City', 'Age', 'Py_Score'], dtype='object')

In [77]:
df.columns[2]

'Age'

In [78]:
df.index = np.arange(10, 17)
df.index
df

      Name         City  Age  Py_Score
10  Xavier  Mexico_city   41      88.0
11     Ann      Toranto   23      79.0
12    Jana       Prague   34      81.0
13      yi     Shanghai   38      80.0
14   Robin   Manchester   31      68.0
15   Jamal        Cairo   37      81.0
16    Nori        Osaka   29      84.0

In [79]:
df.to_numpy()

array([['Xavier', 'Mexico_city', 41, 88.0],
       ['Ann', 'Toranto', 23, 79.0],
       ['Jana', 'Prague', 34, 81.0],
       ['yi', 'Shanghai', 38, 80.0],
       ['Robin', 'Manchester', 31, 68.0],
       ['Jamal', 'Cairo', 37, 81.0],
       ['Nori', 'Osaka', 29, 84.0]], dtype=object)

In [80]:
df.values

array([['Xavier', 'Mexico_city', 41, 88.0],
       ['Ann', 'Toranto', 23, 79.0],
       ['Jana', 'Prague', 34, 81.0],
       ['yi', 'Shanghai', 38, 80.0],
       ['Robin', 'Manchester', 31, 68.0],
       ['Jamal', 'Cairo', 37, 81.0],
       ['Nori', 'Osaka', 29, 84.0]], dtype=object)

In [82]:
df

      Name         City  Age  Py_Score
10  Xavier  Mexico_city   41      88.0
11     Ann      Toranto   23      79.0
12    Jana       Prague   34      81.0
13      yi     Shanghai   38      80.0
14   Robin   Manchester   31      68.0
15   Jamal        Cairo   37      81.0
16    Nori        Osaka   29      84.0

In [83]:
df.dtypes

Name         object
City         object
Age           int64
Py_Score    float64
dtype: object

In [86]:
df_ = df.astype(dtype={'Age': np.int32, 'Py_Score': np.float32})
df_.dtypes

Name         object
City         object
Age           int32
Py_Score    float32
dtype: object

In [87]:
df.ndim

2

In [88]:
df.shape

(7, 4)

In [89]:
df.size

28

In [91]:
df_.memory_usage()

Index       28
Name        56
City        56
Age         28
Py_Score    28
dtype: int64

In [93]:
df['Name']

10    Xavier
11       Ann
12      Jana
13        yi
14     Robin
15     Jamal
16      Nori
Name: Name, dtype: object

In [94]:
df.loc[15]

Name        Jamal
City        Cairo
Age            37
Py_Score     81.0
Name: 15, dtype: object

In [96]:
df.iloc[0]

Name             Xavier
City        Mexico_city
Age                  41
Py_Score           88.0
Name: 10, dtype: object

In [98]:
df.loc[:,'City']

10    Mexico_city
11        Toranto
12         Prague
13       Shanghai
14     Manchester
15          Cairo
16          Osaka
Name: City, dtype: object

In [101]:
df.loc[:,'Age']

10    41
11    23
12    34
13    38
14    31
15    37
16    29
Name: Age, dtype: int64

In [103]:
df.iloc[:,3]

10    88.0
11    79.0
12    81.0
13    80.0
14    68.0
15    81.0
16    84.0
Name: Py_Score, dtype: float64

In [104]:
df.loc[10:14,['City','Name']]

           City    Name
10  Mexico_city  Xavier
11      Toranto     Ann
12       Prague    Jana
13     Shanghai      yi
14   Manchester   Robin

In [105]:
df.iloc[1:5,[1,2]]

          City  Age
11     Toranto   23
12      Prague   34
13    Shanghai   38
14  Manchester   31

In [106]:
df.iloc[1:5:2,1]

11     Toranto
13    Shanghai
Name: City, dtype: object

In [107]:
df.iloc[slice(1,6,2),1]

11     Toranto
13    Shanghai
15       Cairo
Name: City, dtype: object

In [109]:
df.iloc[pd.IndexSlice[1:5:2], 0]

11    Ann
13     yi
Name: Name, dtype: object

In [110]:
df.at[12,'Name']

'Jana'

In [116]:
df.iat[2,0]

'Jana'

In [ ]:
df.columns[2]

'Age'

In [117]:
df.loc[:, 'Py_Score']

10    88.0
11    79.0
12    81.0
13    80.0
14    68.0
15    81.0
16    84.0
Name: Py_Score, dtype: float64

In [119]:
df.loc[:13, 'Py_Score'] = [40, 50, 60, 70] 
df.loc[14:, 'Py_Score'] = 34
df['Py_Score']

10    40.0
11    50.0
12    60.0
13    70.0
14    34.0
15    34.0
16    34.0
Name: Py_Score, dtype: float64